### Assignment - 1
#### Import the necessary libraries

In [4]:
import pandas as pd
import requests

### Import the dataset

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

In [41]:
# Assign it to a variable called users and use the 'user_id' as index
user =requests.get(url)
user=pd.read_csv(url)
user

    user_id|age|gender|occupation|zip_code
0                  1|24|M|technician|85711
1                       2|53|F|other|94043
2                      3|23|M|writer|32067
3                  4|24|M|technician|43537
4                       5|33|F|other|15213
..                                     ...
938                 939|26|F|student|33319
939           940|32|M|administrator|02215
940                 941|20|M|student|97229
941               942|48|F|librarian|78209
942                 943|22|M|student|77841

[943 rows x 1 columns]

In [43]:
# Here we didn't not get all columns 4 number so we need to separate the columns for that

user = pd.read_csv(url, sep="|", index_col="user_id")

In [44]:
# See the first 10 and last 10 entries
user.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

In [45]:
user.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [21]:
# What is the number of observations in the dataset?
print("number of observations : " ,user.count(axis=1,level=None,numeric_only=False))

number of observations :  0      1
1      1
2      1
3      1
4      1
      ..
938    1
939    1
940    1
941    1
942    1
Length: 943, dtype: int64

In [50]:
print("number of observations : " ,user.shape[0])
# 0 for row
# 1 for columns

number of observations :  943

In [51]:
# What is the number of columns in the dataset?
c=user.shape[1]
c

4

In [55]:
# Print the name of all the columns.
user.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [58]:
# for sepcific index
w=user.columns[1]
print(w)
user.columns[3]

gender

'zip_code'

In [62]:
# How is the dataset indexed?
user.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [63]:
# What is the data type of each column?
user.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [70]:
# Print only the occupation column
user["occupation"]

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [73]:
# How many different occupations are in this dataset?
user["occupation"].value_counts().count()

21

In [72]:
user["occupation"].value_counts().count()

21

In [76]:
# what is most frequent occcupation
user["occupation"].value_counts().sort_values(ascending=False).head()

student          196
other            105
educator          95
administrator     79
engineer          67
Name: occupation, dtype: int64